// 聊天配置文件
var mahjongChatTextTable = {
    "1": "你太牛了！",
    "2": "哈哈，手气真好！",
    "3": "快点出牌哟！",
    "4": "今天真高兴！",
    "5": "怎么又断线了，网络怎么这么差啊！",
    "6": "你放炮，我不胡！",
    "7": "你家里是开银行的吧！",
    "8": "不好意思，我有事，要先走一步了。",
    "9": "你的牌打的太好了！",
    "10": "大家好，很高兴见到各位！",
}

//斗地主配置文件
var landChatTextTable = {
    "1": "大家好，很高心见到各位",
    "2": "和你合作真是太愉快了啊",
    "3": "快点啊，都等的我花都谢了",
    "4": "你的牌打的也太好了",
    "5": "不要吵了，不要吵了",
    "6": "怎么又断线了，网络怎么那么差啊",
    "7": "不好意思啊，我得离开一会",
    "8": "不要走，决战到天亮啊",
    "9": "你是妹妹还是哥哥啊",
    "10": "咱交个朋友吧，能告诉我你咋联系的嘛",
    "11": "再见了，俺会想念大家的"
}
var tractorChatTextTable = {
    "1": "30年河东30年河西，你先别得意",
    "2": "上天呀，赐我一把好牌吧",
    "3": "同志们敢不敢火拼一把",
    "4": "就算倾家荡产我也要跟到底",
    "5": "借你的豪车拉我兜兜风",
    "6": "快点下注，别磨磨蹭蹭的",
    "7": "闷到底，看牌是小狗",
    "8": "你敢下我就敢跟，你以为我会怕你",
    "9": "你怎么这么爱看牌",
}
var HundrednnChatTextTable = {
    "1": "破他！破他！破他！",
    "2": "搏一搏，单车变摩托",
    "3": "时间就是金钱，我的朋友",
    "4": "求破，求压满",
    "5": "分少就下庄，别懒在上面了",
    "6": "系统吐币了，赶快压啊",
    "7": "前方高能，要通杀了！！",
    "8": "手气好，怪我喽",
    "9": "一把回到解放前啊",
    "10": "输光了，洗洗睡了"
}
var nnChatTextTable = {
    "1": "别跟我抢庄，小心玩死你们",
    "2": "喂，赶紧亮牌 别墨迹",
    "3": "搏一搏，单车变摩托",
    "4": "呀呀呀，快点呀! 我等的花都谢了",
    "5": "时间就是金钱，我的朋友!!!",
    "6": "我是牛牛我怕谁",
    "7": "大牛吃小牛，哈哈哈",
    "8": "下的多,输的多，小心推注当内裤",
    "9": "有没有天理，有没有王法，这种牌也输",
    "10": "一点小钱，拿去喝茶吧"
}

//推筒子百人场
var tuiTongZiChatTextTable = {
    "1": "破他！破他！破他！",
    "2": "搏一搏，单车变摩托",
    "3": "时间就是金钱，我的朋友",
    "4": "求破，求压满",
    "5": "分少就下庄，别懒在上面了",
    "6": "系统吐币了，赶快压啊",
    "7": "前方高能，要通杀了！！",
    "8": "手气好，怪我喽",
    "9": "一把回到解放前啊",
    "10": "输光了，洗洗睡了"
}




module.exports = {
    faceTables: {
        "1": "face1",
        "2": "face2",
        "3": "face3",
        "4": "face4",
        "5": "face5",
        "6": "face6",
        "7": "face7",
        "8": "face8",
        "9": "face9",
        "10": "face10",
        "11": "face11",
        "12": "face12",
    },

    magicFaceTables: {
        "4": "tomato",
        "5": "knife",
        "6": "flower",
        "7": "bomb",
    },

    magicFaceVipTables: {
        "1": "cheers",
        "2": "egg",
        "3": "shoe",
    },

    chatTextTable: {
        300: landChatTextTable,
        500: tractorChatTextTable,
        5600: mahjongChatTextTable,
        4000: HundrednnChatTextTable,
        3100: tuiTongZiChatTextTable,
        400: nnChatTextTable,


    },
}
